--Add Student
use ELECTRONIC_JOURNAL

select * from Person

select * from [User]

select * from UserRoles

select * from Roles

insert into UserRoles (UserId, RoleId) values ('51062c0f-4a62-4186-930d-62b0a6c7633a', 'S'),
                                              ('d997a46e-bf2b-46e4-96ba-0bf83f1234d6', 'T')

insert into [User] (Id, Username, PasswordHash) values ('51062c0f-4a62-4186-930d-62b0a6c7633a', '123456789', '123456789'),
                                                       ('d997a46e-bf2b-46e4-96ba-0bf83f1234d6', 'qwerty', 'qwerty')

insert into Person (IdPerson, [Name], Gender, IdGroup, Birthday) 
values ('51062c0f-4a62-4186-930d-62b0a6c7633a', 'Хартанович Екатерина Александровна', 'ж', 211, '11.03.1995'),
       ('de3e97ab-4b7b-4b42-af0b-5f0e46d2fcac', 'Горбач Елизавета Юрьевна', 'ж', 211, '07.12.1995'),
	   ('e0ac5909-4fa4-4557-b465-081ac5f2d251', 'Зыкова Кристина Дмитриевна', 'ж', 211, '12.10.1995'),
	   ('6e255609-671f-4a08-a248-7e1f65c1e98c', 'Шенец Екатерина Сергеевна', 'ж', 211, '02.01.1995'),
	   ('2d714dcf-f19e-4bdc-a47f-baa1f328e0fe', 'Борисевич Ольга Анатольевна', 'ж', 211, '09.11.1995'),
	   ('75760786-8980-445e-84ae-a7d20098423d', 'Медведева Мария Андреевна', 'ж', 212, '04.07.1995'),
	   ('a1b61047-69a7-4fda-a43e-90ab94440522', 'Шенец Екатерина Сергеевна', 'ж', 212, '08.01.1995'),
	   ('ffffeb9b-bc3d-45d5-9351-0bd9b5da8f33', 'Шитик Алина Игоревна', 'ж', 212, '02.08.1995'),  
	   ('31c62fdc-9cc0-4dc9-96b8-6b0233910e26', 'Силюк Валерия Ивановна', 'ж', 212, '12.07.1994'),
	   ('6d5366b1-17c6-42b4-8f91-ae538cebf55b', 'Сергель Виолетта Николаевна', 'ж', 212, '06.03.1994'),
	   ('2b46a396-2266-4484-a77d-623d532de75a', 'Добродей Ольга Анатольевна', 'ж', 213, '09.11.1994'),
	   ('9b1dd948-93d0-45b3-be6d-02463b9155ba', 'Подоляк Мария Сергеевна', 'ж', 213, '04.10.1994'),
	   ('4a88c83e-7b0e-4e89-9093-20e527b8e409', 'Никитенко Екатерина Дмитриевна', 'ж', 213, '08.01.1994'),
	   ('7ff86126-6b84-4d88-8a84-847bc8362f4d', 'Яцкевич Галина Иосифовна', 'ж', 213, '02.08.1993'),
	   ('3a94e2f2-f6c7-4784-93b4-81a59f300119', 'Осадчая Эла Васильевна', 'ж', 213, '07.12.1993')

--Add Teacher
insert into Person (IdPerson, [Name], Gender, Pulpit, Birthday) 
values ('d997a46e-bf2b-46e4-96ba-0bf83f1234d6', 'Смелов Владимир Владиславович', 'м', 'ИСиТ', '1956-04-23'),
       ('3e15947f-384e-40f6-a9c2-379e4db2c3e2', 'Акунович Станислав Иванович', 'м', 'ИСиТ', '1959-10-09'),
       ('1971e335-e5fc-4a5a-a7b5-89befc51e8e1', 'Колесников Виталий Леонидович', 'м', 'ИСиТ', '1961-05-12'),
       ('582d4815-4d7c-4c77-9dac-0a31e7870805', 'Бракович Андрей Игоревич', 'м', 'ИСиТ', '1961-12-25'),
       ('9ad6b4d3-b0e4-420b-8518-198b560db77c', 'Дятко Александр Аркадьевич', 'м', 'ИСиТ', '1963-03-28'),
       ('2073f827-dbb8-48f4-861e-3a49a8aa0622', 'Урбанович Павел Павлович', 'м', 'ИСиТ', '1965-07-21'),
       ('103b98d7-7deb-421d-ac0d-226ed28318e2', 'Гурин Николай Иванович', 'м', 'ИСиТ', '1967-05-24'),
       ('b2c70e8f-aca2-4141-b0f6-893ea17af0ed', 'Жиляк Надежда Александровна', 'ж', 'ИСиТ', '1968-02-14'),                     
       ('a1857815-20ff-489d-b4cc-a9d82bf7127b', 'Мороз Елена Станиславовна', 'ж', 'ИСиТ', '1968-04-02'),                                                                                          
       ('62111615-e940-4056-a4b6-0e491eaf8bbb', 'Барташевич Святослав Александрович', 'м', 'ПОиСОИ', '1968-04-25'),
       ('da780374-f7b6-48e4-80e5-4893ff2727e8', 'Арсентьев Виталий Арсентьевич', 'м', 'ПОиСОИ', '1968-06-11'),                       
       ('f22b80c1-99cd-4435-8c89-e2f8e3c3c9e7', 'Барановский Станислав Иванович', 'м', 'ЭТиМ', '1971-07-09'),
       ('95b9f774-5966-4d75-9616-91beef8a5535', 'Неверов Александр Васильевич', 'м', 'МиЭП', '1977-04-12'),
       ('e4dc70c0-7d8d-48ca-b2ae-71a446006939', 'Ровкач Андрей Иванович', 'м', 'ОВ', '1978-01-26'),
       ('f5e91799-6e8f-4c7f-9eb2-0f706f9f12d8', 'Демидко Марина Николаевна', 'ж', 'ЛПиСПС', '1979-08-17'),
       ('8fbbf1f3-1572-4752-bd4d-4e77dea69b7d', 'Бурганская Татьяна Минаевна', 'ж', 'ЛПиСПС', '1982-02-24'),
       ('ba93b75b-95b8-4eb2-99b8-209f1e4d9efa', 'Машковский Владимир Петрович', 'м', 'ЛУ', '1982-06-29'),
       ('017121c0-dd61-4428-8aeb-59d6715597bc', 'Атрощенко Олег Александрович', 'м', 'ЛУ', '1983-07-04'),                   
       ('e20082c1-de75-4764-949b-77b6edfec75f', 'Рожков Леонид Николаевич ', 'м', 'ЛВ', '1987-05-06'),                     
       ('65bba756-23f6-4418-8646-d981d5bf815f', 'Звягинцев Вячеслав Борисович', 'м', 'ЛЗиДВ', '1987-07-21'),
       ('4c0e8f59-4c5c-4585-bc62-2cf0160e4ea5', 'Безбородов Владимир Степанович', 'м', 'ОХ', '1984-08-27'),
       ('7acf9b4e-0da0-4217-8a3e-9fc921f676af', 'Насковец Михаил Трофимович', 'м', 'ТЛ', '1982-07-12'), 
       ('d8c62bad-a71b-4d69-90ef-11225b2a0967', 'Мохов Сергей Петрович', 'м', 'ЛМиЛЗ', '1969-05-08'), 
       ('d0a728ca-34a0-43ed-9f0a-f1b745ac09ea', 'Ещенко Людмила Семеновна', 'ж', 'ТНВиОХТ', '1965-03-26')
